# Series

#### series:it is defined as a 1-D array that is capable of storing varius data types

In [1]:
import pandas as pd

In [2]:
a=[2,3,4,5,6,7]
a1=pd.Series(a)
a2=pd.Series(a,index=['a','s','d','f','g','h'])
print(a1)
print()
print(a2)

0    2
1    3
2    4
3    5
4    6
5    7
dtype: int64

a    2
s    3
d    4
f    5
g    6
h    7
dtype: int64

In [3]:
dic={"name":['python','c','c++','java','c#'],"por":[12,13,14,15],"rank":[1,2,3,4,5]}
print(pd.Series(dic))

name    [python, c, c++, java, c#]
por               [12, 13, 14, 15]
rank               [1, 2, 3, 4, 5]
dtype: object

# DataFrame

In [4]:
dic1={"a":[1,2,366,4,5], "s":[1,2,3,4,5], "d":[1,2,3,4,5], 1:[1,2,3,4,5]}
dic2=pd.DataFrame(dic1,columns=["a","d",1],index=[1,2,3,4,5])
print(dic2)

# accessihng value in an list
print(dic2["a"][3])

     a  d  1
1    1  1  1
2    2  2  2
3  366  3  3
4    4  4  4
5    5  5  5
366

In [5]:
dic3=[[1,2,3,4,5],[7,8,9,0,5]]
dic4=pd.DataFrame(dic3)
print(dic4)

   0  1  2  3  4
0  1  2  3  4  5
1  7  8  9  0  5

## Arthimatic Operation

In [6]:
arth=pd.DataFrame({"A":[1,2,3,4,5,6],"B":[11,22,33,44,55,66]})
print(arth)
print()
arth["C"]=arth["A"]+arth["B"]   # we can perform any type of operation
arth

   A   B
0  1  11
1  2  22
2  3  33
3  4  44
4  5  55
5  6  66

   A   B   C
0  1  11  12
1  2  22  24
2  3  33  36
3  4  44  48
4  5  55  60
5  6  66  72

In [7]:
arth1=pd.DataFrame({"A":[1,2,3,4,5,6],"B":[11,22,33,44,55,66]})
arth1["cmpar'a'"]=arth["A"] >=5
arth1["cmpar'b'"]=arth["B"] <=20
arth1

   A   B  cmpar'a'  cmpar'b'
0  1  11     False      True
1  2  22     False     False
2  3  33     False     False
3  4  44     False     False
4  5  55      True     False
5  6  66      True     False

# Delete & Insert Data

In [8]:
# inserting a column
inst=pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5]})
inst.insert(1,"inert",[10,11,12,13,14])# 1 is the positon of the column heading(0,1,2,3,4......)
inst

   A  inert  B
0  1     10  9
1  2     11  8
2  3     12  7
3  4     13  6
4  5     14  5

In [9]:
dele=pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5],"C":[21,22,23,24,25]})
dele1=dele.pop("B")
print(dele1)
print()
print(dele)

0    9
1    8
2    7
3    6
4    5
Name: B, dtype: int64

   A   C
0  1  21
1  2  22
2  3  23
3  4  24
4  5  25

# Writing on csv

In [10]:
wcsv=pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5],"C":[21,22,23,24,25]})
wcsv1=pd.DataFrame(wcsv)
wcsv.to_csv("hello.csv",index=False,header=["col1","col2","col3"])  
# if index is false in excel sheet index won't appear
# col1,col2,col3 is the column name is printed insted of A,B,C

# Read csv file

In [11]:
csred=pd.read_csv("C:\\Users\\user\\hello.csv")
csred

   col1  col2  col3
0     1     9    21
1     2     8    22
2     3     7    23
3     4     6    24
4     5     5    25

In [12]:
csred1=pd.read_csv("C:\\Users\\user\\hello.csv",nrows=1) # nrows=1 accessing only 1 row in csv file
csred1

   col1  col2  col3
0     1     9    21

In [13]:
csred2=pd.read_csv("C:\\Users\\user\\hello.csv",usecols=["col2"])
csred2       # accessing perticular column only!
 # in the place of usecols we can use skiprows=[x,y] x-row&y-row both are row index skip takes place w.r.t to index

   col2
0     9
1     8
2     7
3     6
4     5

### we can change index column as prefered

In [14]:
csred3=pd.read_csv("C:\\Users\\user\\hello.csv",index_col="col1")
csred3

      col2  col3
col1
1        9    21
2        8    22
3        7    23
4        6    24
5        5    25

# Pandas Functions

In [15]:
# displaying only columns
csred.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [16]:
csred.describe

<bound method NDFrame.describe of    col1  col2  col3
0     1     9    21
1     2     8    22
2     3     7    23
3     4     6    24
4     5     5    25>

In [17]:
print(csred3.head(2)) # displaying starting 2 values of a file
print()
print(csred3.tail(3)) # displaying ending 3 values of a file

       # else we can use [Starting:Ending] insted of                   " .tail() or .head() "

      col2  col3
col1
1        9    21
2        8    22

      col2  col3
col1
3        7    23
4        6    24
5        5    25

#### displaying csv file as numpy array

In [18]:
import numpy as np
v= np.array(csred) # displaying all the columns in the form of array matrix!
v

array([[ 1,  9, 21],
       [ 2,  8, 22],
       [ 3,  7, 23],
       [ 4,  6, 24],
       [ 5,  5, 25]], dtype=int64)

#### reversing the file order from bottam as top w.r.t index value

In [19]:
csred.sort_index(ascending=False)

   col1  col2  col3
4     5     5    25
3     4     6    24
2     3     7    23
1     2     8    22
0     1     9    21

#### Updating values in the csv file w.r.t column heading with index values

In [20]:
csred.loc[2,"col2"]="hello"   # changing the value of 3'rd index of the col21! as "hello"
csred

   col1   col2  col3
0     1      9    21
1     2      8    22
2     3  hello    23
3     4      6    24
4     5      5    25

#### accessing prescribed columns with index

In [21]:
csred.loc[[1,3],["col1","col2"]]   # here we don't use csred as print

   col1 col2
1     2    8
3     4    6

In [22]:
# accessing with column index and row index values
csred.iloc[1,2]

22

# Deleting col's

In [46]:
datz=csred.drop(columns=["col2"])
datz

   col1  col3
0     1    21
1     2    22
2     3    23
3     4    24
4     5    25

# Deleting row's

In [23]:
csred.drop(1,axis=0)  # deleting columns index belongs to 1

   col1   col2  col3
0     1      9    21
2     3  hello    23
3     4      6    24
4     5      5    25

In [24]:
new_csv=pd.read_csv("C:\\Users\\user\\hello1.csv")
new_csv

   col1  col2  col3
0     1   9.0  21.0
1     2   8.0  22.0
2     3   7.0   NaN
3     4   NaN  24.0
4     5   5.0  25.0

### deleting the row if it contains NaN value

In [25]:
new_csv.dropna()

   col1  col2  col3
0     1   9.0  21.0
1     2   8.0  22.0
4     5   5.0  25.0

In [26]:
new_csv.dropna() # if complete row has NaN then we can delete complete row by using " how="all" in the () "
                 # if complete row doesn't NaN than complete row is displayed with the all values

   col1  col2  col3
0     1   9.0  21.0
1     2   8.0  22.0
4     5   5.0  25.0

### filling the NaN with any same value

In [27]:
n=new_csv.fillna("any value")
print(n)
new_csv.fillna({"col2":"one","col3":"two"})  # filling one column with some name and another with another

   col1       col2       col3
0     1        9.0       21.0
1     2        8.0       22.0
2     3        7.0  any value
3     4  any value       24.0
4     5        5.0       25.0

   col1 col2  col3
0     1  9.0  21.0
1     2  8.0  22.0
2     3  7.0   two
3     4  one  24.0
4     5  5.0  25.0

### replacing data

In [28]:
new_csv.replace(5,5905786)

      col1       col2  col3
0        1        9.0  21.0
1        2        8.0  22.0
2        3        7.0   NaN
3        4        NaN  24.0
4  5905786  5905786.0  25.0

In [29]:
new_csv.replace(to_replace=1,value=100000)   # replace of 1 with 100000
                                           # if we need to replace word with word we use to_replace="hello",value="hello1"
                                           # if we need to replace number with number then simply new_csv.replace(initial,final)

     col1  col2  col3
0  100000   9.0  21.0
1       2   8.0  22.0
2       3   7.0   NaN
3       4   NaN  24.0
4       5   5.0  25.0

### filling the nearest value in the NaN

In [30]:
new_csv.interpolate()

   col1  col2  col3
0     1   9.0  21.0
1     2   8.0  22.0
2     3   7.0  23.0
3     4   6.0  24.0
4     5   5.0  25.0

# Merge Operation

In [31]:
mer1=pd.DataFrame({"A":[1,2,3,4,5],"B":[10,11,12,13,14]})
mer2=pd.DataFrame({"A":[1,2,3,4,6],"C":[20,21,22,23,24]})
pd.merge(mer1,mer2,on="A") # on is used when ever A have same coincide a=data gets merged

   A   B   C
0  1  10  20
1  2  11  21
2  3  12  22
3  4  13  23

In [32]:
mer1=pd.DataFrame({"A":[1,2,3,4,5],"B":[10,11,12,13,14]}) # A_x and B get's merge
mer2=pd.DataFrame({"A":[1,2,3,4,6],"C":[20,21,22,23,24]}) # A_y and C gets merge merges without having any common
pd.merge(mer1,mer2,left_index=True,right_index=True)

# by using suffixes=(suff of _x,suff of _y) in merge(->) we can add any value in _x,_y

   A_x   B  A_y   C
0    1  10    1  20
1    2  11    2  21
2    3  12    3  22
3    4  13    4  23
4    5  14    6  24

In [33]:
pd.concat([mer1,mer2],axis=0) # by using concatse add data in the vertical
                              # if we use axis=0 or just nothing is not a matter

   A     B     C
0  1  10.0   NaN
1  2  11.0   NaN
2  3  12.0   NaN
3  4  13.0   NaN
4  5  14.0   NaN
0  1   NaN  20.0
1  2   NaN  21.0
2  3   NaN  22.0
3  4   NaN  23.0
4  6   NaN  24.0

In [34]:
pd.concat([mer1,mer2],axis=1)  # merging is takesplace according to the index matching

   A   B  A   C
0  1  10  1  20
1  2  11  2  21
2  3  12  3  22
3  4  13  4  23
4  5  14  6  24

# Join

In [35]:
jo1=pd.DataFrame({"A":[1,2,3,4,5],"B":[10,11,12,13,14]})
jo2=pd.DataFrame({"C":[1,2,3,4,6],"D":[20,21,22,23,24]})
jo1.join(jo2)  # joining jo2 to with jo1

   A   B  C   D
0  1  10  1  20
1  2  11  2  21
2  3  12  3  22
3  4  13  4  23
4  5  14  6  24

# GroupBy

In [36]:
grup=pd.DataFrame({
    "Name":["a","b","c","d","a","b","a","b","a","c","c","d"],
    "S_1":[12,13,14,12,13,14,15,23,25,16,10,34],
    "S_2":[23,24,25,26,27,28,29,30,25,34,35,56]
})
grup

   Name  S_1  S_2
0     a   12   23
1     b   13   24
2     c   14   25
3     d   12   26
4     a   13   27
5     b   14   28
6     a   15   29
7     b   23   30
8     a   25   25
9     c   16   34
10    c   10   35
11    d   34   56

### Grouping w.r.t to name grups gets seperated by in the basis of samename

In [37]:
grup1=grup.groupby("Name")

In [38]:
for x,y in grup1:
    print(x)
    print(y)
    print()

a
  Name  S_1  S_2
0    a   12   23
4    a   13   27
6    a   15   29
8    a   25   25

b
  Name  S_1  S_2
1    b   13   24
5    b   14   28
7    b   23   30

c
   Name  S_1  S_2
2     c   14   25
9     c   16   34
10    c   10   35

d
   Name  S_1  S_2
3     d   12   26
11    d   34   56

In [39]:
grup1.get_group("a")  # grouping ny it's name

  Name  S_1  S_2
0    a   12   23
4    a   13   27
6    a   15   29
8    a   25   25

In [40]:
print(grup1.min())
print()
print(grup1.max())
print()
print(grup1.mean())

      S_1  S_2
Name
a      12   23
b      13   24
c      10   25
d      12   26

      S_1  S_2
Name
a      25   29
b      23   30
c      16   35
d      34   56

            S_1        S_2
Name
a     16.250000  26.000000
b     16.666667  27.333333
c     13.333333  31.333333
d     23.000000  41.000000

In [41]:
list(grup1)  # converting data into list

[('a',
    Name  S_1  S_2
  0    a   12   23
  4    a   13   27
  6    a   15   29
  8    a   25   25),
 ('b',
    Name  S_1  S_2
  1    b   13   24
  5    b   14   28
  7    b   23   30),
 ('c',
     Name  S_1  S_2
  2     c   14   25
  9     c   16   34
  10    c   10   35),
 ('d',
     Name  S_1  S_2
  3     d   12   26
  11    d   34   56)]

# Pivot

In [42]:
piv=pd.DataFrame({
    "days":[1,1,1,1,2,2,],
    "st_name":["a","b","a","a","b","b"],
    "eng":[10,12,14,15,16,12],
    "maths":[17,18,19,13,14,16]
})
piv

   days st_name  eng  maths
0     1       a   10     17
1     1       b   12     18
2     1       a   14     19
3     1       a   15     13
4     2       b   16     14
5     2       b   12     16

In [43]:
piv.pivot_table(index="st_name",columns="days",aggfunc="sum",margins="True")

# sum ,avg,mean,....

          eng           maths
days        1     2 All     1     2 All
st_name
a        39.0   NaN  39  49.0   NaN  49
b        12.0  28.0  40  18.0  30.0  48
All      51.0  28.0  79  67.0  30.0  97